``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.training-vm-eu[0] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-0.eu.training.galaxyproject.eu_A"
        name    = "gat-0.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.47.189",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[1] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-1.eu.training.galaxyproject.eu_A"
        name    = "gat-1.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.47.63",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[2] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-2.eu.training.galaxyproject.eu_A"
        name    = "gat-2.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.42.84",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[3] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-3.eu.training.galaxyproject.eu_A"
        name    = "gat-3.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.45.160",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[4] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-4.eu.training.galaxyproject.eu_A"
        name    = "gat-4.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.47.70",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[5] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-5.eu.training.galaxyproject.eu_A"
        name    = "gat-5.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.46.207",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[6] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-6.eu.training.galaxyproject.eu_A"
        name    = "gat-6.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.43.176",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[7] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-7.eu.training.galaxyproject.eu_A"
        name    = "gat-7.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.47.134",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[8] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-8.eu.training.galaxyproject.eu_A"
        name    = "gat-8.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.46.213",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.training-vm-eu[9] will be updated in-place
  ~ resource "aws_route53_record" "training-vm-eu" {
        id      = "Z05016927AMHTHGB1IS2_gat-9.eu.training.galaxyproject.eu_A"
        name    = "gat-9.eu.training.galaxyproject.eu"
      ~ records = [
          - "192.52.43.249",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # openstack_compute_instance_v2.training-vm-eu[0] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.47.189" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "99471c33-8107-467d-b129-e5dce5a3282a" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-0.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.47.189" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:0e:5f:75" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[1] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.47.63" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "c7d37f1c-ea18-43fa-b2ca-524564ed044c" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-1.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.47.63" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:db:b9:80" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[2] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.42.84" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "c0ebe756-dcc5-455a-a04d-ef185f7893a1" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-2.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.42.84" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:b2:50:bd" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[3] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.45.160" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "da8b7554-ec93-48ee-b64d-d12704a48379" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-3.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.45.160" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:2f:6d:6b" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[4] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.47.70" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "cbe9017c-5044-48b6-b0c4-6cf3a3a3f188" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-4.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.47.70" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:ca:96:cd" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[5] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.46.207" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "32fa048f-9f87-4d51-b315-ad04f0c9b768" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-5.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.46.207" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:d2:46:e3" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[6] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.43.176" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "ef1a76b6-2dfc-4b36-8c2d-2a0791302843" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-6.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.43.176" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:37:f1:20" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[7] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.47.134" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "9ba97d65-2354-4552-98ea-632a7993a19c" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-7.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.47.134" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:18:e9:86" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[8] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.46.213" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "06aa6914-ce3e-41e9-804e-da82d618120a" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-8.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.46.213" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:df:2a:b2" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_instance_v2.training-vm-eu[9] must be replaced
-/+ resource "openstack_compute_instance_v2" "training-vm-eu" {
      ~ access_ip_v4        = "192.52.43.249" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_id           = "1068e9f1-be81-4a7e-be84-b9ce6139a21d" -> (known after apply)
      ~ id                  = "1ab1bf02-6760-4dba-97cd-cc30ccd11188" -> (known after apply)
      ~ image_id            = "Attempt to boot from volume - no image supplied" -> (known after apply)
      + image_name          = (known after apply)
      ~ key_pair            = "cloud2" -> "gat" # forces replacement
        name                = "gat-9.eu.training.galaxyproject.eu"
      ~ region              = "Freiburg" -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ block_device {
            # (6 unchanged attributes hidden)
        }

      ~ network {
          ~ fixed_ip_v4    = "192.52.43.249" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:ca:db:81" -> (known after apply)
            name           = "public"
          + port           = (known after apply)
          ~ uuid           = "60775850-0c04-4a6d-b607-ad1d75ee2900" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # openstack_compute_keypair_v2.gat will be created
  + resource "openstack_compute_keypair_v2" "gat" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "gat"
      + private_key = (known after apply)
      + public_key  = "ecdsa-sha2-nistp521 AAAAE2VjZHNhLXNoYTItbmlzdHA1MjEAAAAIbmlzdHA1MjEAAACFBAH+o75mk9SSNDEjwpIrgtBfKtYFhF73qIvuc8lQbrscZFyRMzd/ZnqlAq+lqaqag2CTp3laVeHr1okuLEOQAkFxtAE/qj/+AXXXEB55zmvo5eCasPIixAtcbNF6fUrd/Y0ePoZHvFbsdproliDWwEsHnCki90IDxy4b4cElo71eDxYjFg== mk@galaxy-mira"
      + region      = (known after apply)
    }

Plan: 11 to add, 10 to change, 10 to destroy.

Changes to Outputs:
  ~ training_ips-eu = [
      - [
          - "192.52.47.189",
          - "192.52.47.63",
          - "192.52.42.84",
          - "192.52.45.160",
          - "192.52.47.70",
          - "192.52.46.207",
          - "192.52.43.176",
          - "192.52.47.134",
          - "192.52.46.213",
          - "192.52.43.249",
        ],
      + [
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```